app/controllers/categories_controller.rb

  def index
    @title = "Video Category"
    @categories = Category.all
---
SELECT * FROM "categories"

  def show
    @title = "Videos under each Category"
    @category = Category.find(params[:id])
	@videos = Video.find(:all, :conditions => {:category_id => @category.id}, :select => "title").map(&:title)
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT title FROM "videos" WHERE ("videos"."category_id" = 1)

  def edit
	@title = "Edit Category"
    @category = Category.find(params[:id])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('Kids', '2010-08-12 17:43:30', '2010-08-12 17:43:30')

  def update
	@title = "Update Category"
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "updated_at" = '2010-08-13 17:50:01', "name" = 'Kids' WHERE "id" = 1