app/controllers/checkout_statuses_controller.rb

  def index
    @checkout_statuses = CheckoutStatus.all
---
SELECT * FROM "checkout_statuses" WHERE ("checkout_statuses".user_id = 5)