app/controllers/checkout_statuses_controller.rb

  def new
	@checkout_status = CheckoutStatus.new
	@video = Video.find( params[:video_id] )
---
SELECT * FROM "videos" WHERE ("videos"."id" = 4)

  def create
	@video = Video.find( params[:video_id] )
	@checkout_status = CheckoutStatus.new
	@checkout_status.user = current_user
	@checkout_status.video = @video
	@checkout_status.save
---
SELECT * FROM "videos" WHERE ("videos"."id" = 4)
INSERT INTO "checkout_statuses" ("created_at", "video_id", "updated_at", "user_id") VALUES('2010-08-19 16:13:57', 4, '2010-08-19 16:13:57', 5)

  def destroy
	@checkout_status = CheckoutStatus.find( params[:id] )
	@checkout_status.delete
---
SELECT * FROM "checkout_statuses" WHERE ("checkout_statuses"."id" = 1)
DELETE FROM "checkout_statuses" WHERE ("id" IN (1))