app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @title = "List Users"
    @users = User.all

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
	@title = "Details of User"
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def edit
	@title = "Change User Details"
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "salt", "encrypted_password", "created_at", "updated_at", "admin", "phone_number", "remember_token", "password", "email", "password_confirm") VALUES('Sherley Mathew', '378a7cbb6179266b8d4e5b25e67c6905c1c38aad43de6381a5cfdb4eff35d4f2', '730d1e4b477bb2ab1a22112734cbf015e68e21fdb1015b120d5f0c838a65c06a', '2010-08-17 20:01:46', '2010-08-17 20:01:46', NULL, '901-542-7821', NULL, 'abcd1234', 'smathew@shareone.com', 'abcd1234')
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-08-19 18:05:29', "encrypted_password" = '132a58c7c0fb875bc4a6e572895d38cc8697cd0813f6931207c60a6b473d1b31', "salt" = 'f3fa142ee89189fbf7eecf0d17857a4f8f0cb277d49831db838eae546dd520c6', "name" = 'Mrs. Wright Morgan' WHERE "id" = 5
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def destroy
    User.find(params[:id]).destroy