app/controllers/videos_controller.rb

SELECT * FROM "videos" WHERE ("videos"."id" = 27)
---
  def checkout
    @video = Video.find(params[:id])