app/controllers/videos_controller.rb

  def index
    @videos = Video.all
---
SELECT * FROM "videos"

  def show
    @video = Video.find(params[:id])
	@checkout_statuses = CheckoutStatus.find(:all, :conditions => {:video_id => @video.id, :user_id => current_user.id}, :select => "video_id").map(&:video_id)
---
SELECT * FROM "videos" WHERE ("videos"."id" = 2)
SELECT video_id FROM "checkout_statuses" WHERE ("checkout_statuses"."video_id" = 28 AND "checkout_statuses"."user_id" = 8)

  def edit
    @video = Video.find(params[:id])
---
SELECT * FROM "videos" WHERE ("videos"."id" = 1)

  def create
    @video = Video.new(params[:video])

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("created_at", "title", "updated_at", "category_id") VALUES('2010-08-13 16:39:09', 'utuitkutku', '2010-08-13 16:39:09', NULL)

  def update
    @video = Video.find(params[:id])

    respond_to do |format|
      if @video.update_attributes(params[:video])
---
SELECT * FROM "videos" WHERE ("videos"."id" = 1)
UPDATE "videos" SET "updated_at" = '2010-08-13 17:50:31', "title" = 'Barney' WHERE "id" = 4

  def destroy
    @video = Video.find(params[:id])
    @video.destroy
---
SELECT * FROM "videos" WHERE ("videos"."id" = 4)
DELETE FROM "videos" WHERE "id" = 4